In [84]:
import pandas as pd
import numpy as np

In [62]:
df = pd.read_csv('raw_data.csv')

In [63]:
df.describe()

         Bedrooms
count  199.000000
mean     3.346734
std      1.331581
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      8.000000

In [64]:
df.head()

,Price,Address,Bedrooms,Description
0,"£11,251,000","71 Bondway, London, SW8 1SF",5.0,** THE HEIGHT OF LUXURY IN AN EXCEPTIONAL SETT...
1,"£6,500,000","16 Wotton Road, Cricklewood, NW2 6PX",5.0,A unique opportunity to secure this superbly r...
2,"£3,500,000","Kensington Court Place, London, W8 5BJ",3.0,We are pleased to offer this superb three bedr...
3,"£2,571,000","71 Bondway, London, SW8 1SF",3.0,** CITY VIEWS OF THE OVAL CRICKET GROUND AND C...
4,"£2,495,000","Princes Gate, London, SW7 2QG",3.0,We are pleased to offer this exceptional 3 bed...

In [65]:
df.tail()

,Price,Address,Bedrooms,Description
195,"£650,000","Mornington Road, Greenford, UB6 9HH",5.0,Purplebricks are excited to introduce this inc...
196,"£650,000","Beaufort Avenue, Harrow, HA3 8PF",3.0,"""Chain Free With Huge Potential STPP"" ""Clean A..."
197,"£650,000","Dagmar Road, London, N4 4NY",2.0,*SECOND FLOOR APARTMENT WITH STUNNING SKYLINE ...
198,"£650,000","Cairnfield Avenue, Neasden, NW2 7PE",3.0,Well proportioned three bedroom semi detached ...
199,"£650,000","Park Ridings, London, N8 0LD",3.0,Purplebrick are proud to bring to market this ...

In [66]:
# Create a new column which only contains the property postcode
df['Postcode'] = df['Address'].str.extract(r'([a-zA-Z]+[\d]+)')

df.head()

,Price,Address,Bedrooms,Description,Postcode
0,"£11,251,000","71 Bondway, London, SW8 1SF",5.0,** THE HEIGHT OF LUXURY IN AN EXCEPTIONAL SETT...,SW8
1,"£6,500,000","16 Wotton Road, Cricklewood, NW2 6PX",5.0,A unique opportunity to secure this superbly r...,NW2
2,"£3,500,000","Kensington Court Place, London, W8 5BJ",3.0,We are pleased to offer this superb three bedr...,W8
3,"£2,571,000","71 Bondway, London, SW8 1SF",3.0,** CITY VIEWS OF THE OVAL CRICKET GROUND AND C...,SW8
4,"£2,495,000","Princes Gate, London, SW7 2QG",3.0,We are pleased to offer this exceptional 3 bed...,SW7

In [67]:
# Remove symbols from the price column
df['Price'] = df['Price'].str.replace("£", "").str.replace(",", "")

df.head()

,Price,Address,Bedrooms,Description,Postcode
0,11251000,"71 Bondway, London, SW8 1SF",5.0,** THE HEIGHT OF LUXURY IN AN EXCEPTIONAL SETT...,SW8
1,6500000,"16 Wotton Road, Cricklewood, NW2 6PX",5.0,A unique opportunity to secure this superbly r...,NW2
2,3500000,"Kensington Court Place, London, W8 5BJ",3.0,We are pleased to offer this superb three bedr...,W8
3,2571000,"71 Bondway, London, SW8 1SF",3.0,** CITY VIEWS OF THE OVAL CRICKET GROUND AND C...,SW8
4,2495000,"Princes Gate, London, SW7 2QG",3.0,We are pleased to offer this exceptional 3 bed...,SW7

In [68]:
# Check for duplicates and inspect them if there are any
duplicates = df[df.duplicated(keep=False)]

if len(duplicates) > 0:
    print('The following are duplicates:')
    print(duplicates)
else:
    print('No duplicates')

The following rows are duplicates:
      Price                      Address  Bedrooms  \
9   1753000  71 Bondway, London, SW8 1SF       2.0
10  1753000  71 Bondway, London, SW8 1SF       2.0

                                          Description Postcode
9   ** FAN OF CRICKET? WITH DIRECT OF VIEWS OF THE...      SW8
10  ** FAN OF CRICKET? WITH DIRECT OF VIEWS OF THE...      SW8

In [69]:
# Drop any duplicates
df = df.drop_duplicates()

duplicates = df[df.duplicated(keep=False)]

if len(duplicates) > 0:
    print('The following are duplicates:')
    print(duplicates)
else:
    print('No duplicates')

There are no duplicates in the DataFrame.

In [70]:
# Check for missing values and inspect them if there are any
missing_values = df.isna()

missing_rows = df[missing_values.any(axis=1)]

if len(missing_rows) < 1:
    print("No missing values")
else:
    print(missing_rows)

      Price                      Address  Bedrooms  \
154  712000  71 Bondway, London, SW8 1SF       NaN

                                           Description Postcode
154  ** DESIGN INSPIRED BY VERSCAE, BRAND NEW LUXUR...      SW8

In [71]:
# There was one missing value in the bedroom column, it will be imputed to the mean and then rounded as you can't have 3.3 bedrooms
impute_mean = round(df['Bedrooms'].mean())

df['Bedrooms'] = df['Bedrooms'].fillna(impute_mean)

In [72]:
# Checking to see if the previous was effective
missing_values = df.isna()

missing_rows = df[missing_values.any(axis=1)]

if len(missing_rows) < 1:
    print("No missing values")
else:
    print(missing_rows)

No missing values

In [73]:
# As previously mentioned, you can't have 1.3 bedrooms, so making sure all values in this column are whole numbers
non_integers = df['Bedrooms'] % 1 != 0

if any(non_integers):
    print(df[non_integers])
else:
    print("0 non-integers")

Bedrooms has no non-integers.

In [74]:
df.dtypes

Price           object
Address         object
Bedrooms       float64
Description     object
Postcode        object
dtype: object

In [75]:
# Changing the data types of these columns after inspecting them previously
df['Price'] = df['Price'].astype('int')
df['Bedrooms'] = df['Bedrooms'].astype('int')
df['Postcode'] = df['Postcode'].astype('category')

print(df.dtypes)

Price             int32
Address          object
Bedrooms          int32
Description      object
Postcode       category
dtype: object

In [78]:
# It was displaying the values with scientific notation so had to use this to suppress it
pd.set_option('display.float_format', lambda x: '%.3f' % x)
df.describe()

             Price  Bedrooms
count      199.000   199.000
mean   1016886.181     3.352
std     914897.922     1.328
min     650000.000     1.000
25%     725000.000     2.000
50%     815000.000     3.000
75%     990000.000     4.000
max   11251000.000     8.000

In [83]:
# The line below can be used to export the clean dataset as a csv file
# df.to_csv("clean_data.csv", index=False)

In [85]:
# Dependency to export to AWS, otherwise not needed
import boto3

In [91]:
# This is used to export the df as a csv file and store it in the specified s3 bucket
filename = 'clean_data.csv'
bucketname = 'ahmad-bucket123'

csv_buffer = df.to_csv(index=False)

client = boto3.client('s3')

response = client.put_object(
    Body=csv_buffer,
    Bucket=bucketname,
    Key=filename
)